package Lesson_4;

import java.util.Arrays;

public class HW_2 {
    public static void main(String[] args) {
        //Задача №2
        //Необходимо вывести все положительные степени числа 5 которые меньше 10000,
        //вывести результат возведения в степень.

        for (int i = 1; i < 10000; i = i * 5) {
                System.out.println(i);
        }
    }
}
