package Lesson_2_variables;

public class HW_3 {
    public static void main(String[] args) {
        //Задача Экстра, с двумя звездочками
        //Вывести/напечатать смайлик (не :), а настоящий смайлик одним символом).
        System.out.println("\uD83D\uDE0A");
    }
}
