package Lesson_6;

public class HW_1 {
    public static void main(String[] args) {
//Задача №1
//Дан массив:
//int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//необходимо вывести сумму элементов массива.
//Задача №2
//Дан массив:
//int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//необходимо вывести максимальное значение массива.
//Задача №3
//Дан массив:
//int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//необходимо вывести минимальное значение массива.
//Задача №3
//Дан массив:
//int[][] array = {{1, 2, 3, 4, 5}, {6, 7, 8, 9}, {-1, -2, -3, -4}, {-5, -6}};
//необходимо вывести количество элементов в массиве.
        int[][] array = {
                {1, 2, 3, 4, 5},
                {6, 7, 8, 9},
                {-1, -2, -3, -4},
                {-5, -6}
        };
        int sum = 0;
        int max = Integer.MIN_VALUE;
        int min = Integer.MAX_VALUE;
        int count =0;
        int count2 = 0;

        for (int i = 0; i < array.length; i++) {
            count2 += array[i].length; //бежим по массиву и считываем длину эл-в.
            for (int j = 0; j < array[i].length; j++) {
                sum = array[i][j] + sum;
                if (array[i][j] > max){
                    max = array[i][j];
                }
                if (array[i][j] < min){
                    min = array[i][j];
                }
                count ++; // Бжим по массиву и считываем каждый эл-т
            }
        }
        System.out.println("Сумма элементов массива = " + sum);
        System.out.println("Максимальное значение массива = " + max);
        System.out.println("Минимальное значение массива = " + min);
        System.out.println("Количество элементов в массиве = " + count);
        System.out.println("Количество элементов в массиве 2 способ = " + count2);
    }
}
